test/load.yaml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 1
  variables:
    product_id:
      - "12"
scenarios:
  - flow:
    - get:
        url: "/products"
    - get:
        url: "/products/{{ product_id }}"
    - get:
        url: "/products/{{ product_id }}/styles"
    - get:
        url: "/products/{{ product_id }}/related"
    - get:
        url: "/sdc"
        qs:
          ids: "1,2,3"